--Створення таблиці

CREATE TABLE EMP
(
 EMPNO   INT PRIMARY KEY (EMPNO),
 ENAME VARCHAR(50),
 JOB     VARCHAR(50),
 MGR     VARCHAR(50),
 HIREDATE DATE,
 SAL      DECIMAL(16,2),
 COMM     INT,
 DEPTNO     INT
)
CREATE TABLE TriggerTable
(
 ID   INT PRIMARY KEY (ID),
 UpdateDate DATE,
)
--Додавання данних до таблиці


INSERT INTO EMP (EMPNO, ENAME, JOB, MGR, HIREDATE, SAL,COMM,DEPTNO)
VALUES (7369,'SMITH','CLERK',7902,'1980-12-17', 800, NULL, 20),
(7499, 'ALLEN', 'SALESMAN', 7698, '1981-02-20', 1600, 300, 30),
(7521, 'WARD', 'SALESMAN', 7698, '1981-02-22', 1250, 500, 30),
( 7566, 'JONES', 'MANAGER', 7839, '1981-04-02', 2975, NULL, 20),
( 7654, 'MARTIN', 'SALESMAN', 7698, '1981-09-28', 1250, 1400, 30),
(7698, 'BLAKE', 'MANAGER', 7839, '1981-05-01', 2850, NULL,30),
(7782, 'CLARK', 'MANAGER', 7839, '1981-06-09', 2450, NULL, 10),
(7788, 'SCOTT', 'ANALYST', 7566, '1982-12-09', 3000, NULL, 20),
(7839, 'KING', 'PRESIDENT', NULL, '1981-11-17', 5000, NULL, 10),
(7844, 'TURNER', 'SALESMAN', 7698, '1981-09-08', 1500, 0, 30),
(7876, 'ADAMS', 'CLERK', 7788, '1983-01-12', 1100, NULL, 20),
(7900, 'JAMES', 'CLERK', 7698, '1981-12-03', 950, NULL, 30),
( 7902, 'FORD','ANALYST', 7566, '1981-12-03', 3000, NULL, 20),
( 7934, 'MILLER', 'CLERK', 7782, '1982-01-23', 1300, NULL, 10)

--1. Назвіть три етапи проектування БД 

-- Концептуальне, логічяне та фізичне

--2.На якому етапі проектування відбувається встановлення та налаштування СУБД?  

-- Фізичний 

--3.На якому етапі проектування відбувається визначення зв'язків між сутностями та їх документування? 

-- Логічне

--4. На якому етапі проектування відбувається нормалізація таблиць? 

-- Логічне

--5. Третя нормальна форма БД (вимоги) 

-- Таблиця повина бути в 2-ій НФ
-- Тринзитивність залежності атрибутів. Дані повинні залежати від Первиниго ключа
--(Наприклад, у талиці СТУДЕНТ з первиним ключом STUDENTID, не може бути поле GROUP_NAME, яка залежить від IDGROUP, в цьому випадку робиться декомпозиція таблиці,
--створюєтся окрема таблиця для Групи, і зовнішній ключ на цю таблицю в таблиці STUDENT)

--6. Що таке транзакція? 

-- Це послідовний набір операцій над даними які мають властивості ACID.

--7.Що таке ACID? (


-- Це принципи які гарантують цілісність та надійність даних.

-- Атомарність - Операції викунуються повністю всі або жодна з них, якщо одна з операцій не виконана, то  зміни скасувуються та відкатуються на початковий стан бази
-- Узгодженість - система в узгодженому стані до початку та після транзакції. Тобто дотримані обмежень і правил бд.
-- Ізольованість - жодна зміна не видна до завершення транзакції.
--Довговічність - гарантує, що незалежно від проблем системи, після відновлення, результат транзакції буде збережений.

--8. Що таке тригер в БД? (

-- Це процедура, яка виконується автоматично у відповідь на якусб дію.(вставка, оновлення, видалення даних)

--9.Створити AFTER INSERT` тригер у базі даних.


CREATE TRIGGER UpdateDate
ON EMP
AFTER INSERT 
AS
BEGIN
	SET NOCOUNT ON;

	INSERT INTO  TriggerTable (ID, UpdateDate)
	SELECT s.EMPNO, GETDATE()
	FROM inserted s
END;

INSERT INTO EMP (EMPNO, ENAME, JOB, MGR, HIREDATE, SAL,COMM,DEPTNO)
VALUES (73692,'SMITH','CLERK',7902,'1980-12-17', 800, NULL, 20)

SELECT * FROM EMP
SELECT * FROM TriggerTable